paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_serial_handler_access.c
}
static void test_access_elem_models_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_ELEM_MODELS_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t);
    access_element_models_get_ExpectAndReturn(0, NULL, NULL, NRF_SUCCESS);
    access_element_models_get_IgnoreArg_element_index();
    access_element_models_get_IgnoreArg_p_count();
    access_element_models_get_IgnoreArg_p_models();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectAndReturn(SERIAL_OPCODE_CMD_ACCESS_ELEM_MODELS_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_elem_models_get_t), 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_element_models_get_ExpectAndReturn(0, NULL, NULL, NRF_ERROR_INVALID_LENGTH);
    access_element_models_get_IgnoreArg_element_index();
    access_element_models_get_IgnoreArg_p_count();
    access_element_models_get_IgnoreArg_p_models();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_INVALID_LENGTH, SERIAL_STATUS_ERROR_INVALID_LENGTH);
    serial_cmd_rsp_send_ExpectAndReturn(SERIAL_OPCODE_CMD_ACCESS_ELEM_MODELS_GET, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, sizeof(serial_evt_cmd_rsp_data_elem_models_get_t), 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_element_models_get_ExpectAndReturn(0, NULL, NULL, NRF_ERROR_NO_MEM);
    access_element_models_get_IgnoreArg_element_index();
    access_element_models_get_IgnoreArg_p_count();
    access_element_models_get_IgnoreArg_p_models();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_ExpectAndReturn(SERIAL_OPCODE_CMD_ACCESS_ELEM_MODELS_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

}

static void test_access_flash_store()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_ACCESS_FLASH_STORE;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD, SERIAL_PACKET_LENGTH_OVERHEAD);
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD;
    access_flash_config_store_Expect();
    serial_cmd_rsp_send_ExpectAndReturn(SERIAL_OPCODE_CMD_ACCESS_ACCESS_FLASH_STORE, SERIAL_STATUS_SUCCESS, NULL, 0, 0);
    serial_handler_access_rx(&cmd);
}

void setUp(void)
{
    CMOCK_SETUP(serial);
    CMOCK_SETUP(access_config);
    CMOCK_SETUP(access);
    m_assertion_handler = assertion_handler;
}

void tearDown(void)
{
    serial_mock_Verify();
    access_config_mock_Verify();
    access_mock_Verify();
    CMOCK_TEARDOWN();
}

static void (*opcode_test_fp[])() ={test_access_model_pub_addr_set, test_access_model_pub_addr_get,
    test_access_model_pub_period_set, test_access_model_pub_period_get, test_access_model_subs_add,
    test_access_model_subs_remove, test_access_model_subs_get, test_access_model_app_bind,
    test_access_model_app_unbind, test_access_model_app_get, test_access_model_pub_app_set,
    test_access_model_pub_app_get, test_access_model_pub_ttl_set, test_access_model_pub_ttl_get,
    test_access_elem_loc_set, test_access_elem_loc_get, test_access_elem_sig_model_count_get,
    test_access_elem_vendor_model_count_get, test_access_model_id_get, test_access_handle_get,
    test_access_elem_models_get, test_access_flash_store};
/*****************************************************************************
* Tests
*****************************************************************************/
void test_access_rx(void)
{
    /**************  INVALID OPCODES  **************/
    serial_packet_t cmd;
    /* < SERIAL_OPCODE_CMD_RANGE_ACCESS_START should cause in unknown cmd response */
    for (uint32_t i = 0; i < SERIAL_OPCODE_CMD_RANGE_ACCESS_START; ++i)
    {
        cmd.opcode = i;
        serial_cmd_rsp_send_ExpectAndReturn(i, SERIAL_STATUS_ERROR_CMD_UNKNOWN, NULL, 0, 0);
        serial_handler_access_rx(&cmd);
    }
    /* > SERIAL_OPCODE_CMD_RANGE_ACCESS_END should cause an ASSERT */
    for (uint32_t i = SERIAL_OPCODE_CMD_RANGE_ACCESS_END+1; i <= UINT8_MAX; ++i)
    {
        cmd.opcode = i;
        TEST_NRF_MESH_ASSERT_EXPECT(serial_handler_access_rx(&cmd));
    }
    /* Check that we have a test for each command opcode */
    const uint8_t sizeof_fp = sizeof(void(*)());
    TEST_ASSERT_EQUAL_MESSAGE(SERIAL_OPCODE_CMD_RANGE_ACCESS_END - SERIAL_OPCODE_CMD_RANGE_ACCESS_START + 1 , sizeof(opcode_test_fp)/sizeof_fp, "Not all the serial access opcodes are tested, or the START and END values are incorrect.");

    /* Execute every test. */
    for (uint32_t i = SERIAL_OPCODE_CMD_RANGE_ACCESS_START; i <= SERIAL_OPCODE_CMD_RANGE_ACCESS_END ; ++i)
    {
        opcode_test_fp[i-SERIAL_OPCODE_CMD_RANGE_ACCESS_START]();
    }
}
